---
kind: type
id: T:Autodesk.Revit.DB.Architecture.BreakPatternCondition
source: html/f1d994b6-e7a1-3932-331d-3c0e83bc002d.htm
---
# Autodesk.Revit.DB.Architecture.BreakPatternCondition

Condition on which patterns distribution will be broken.

## Syntax (C#)
```csharp
public enum BreakPatternCondition
```